Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Автомобили</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
				<xr:Item>Catalog.Марки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Comment>VIN-код автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Comment>Дата выпуска автомобиля</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Comment>№ двигателя автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Comment>№ кузова автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШасси</Name>
					<Comment>№ шасси автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>Цвет автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКод</Name>
					<Comment>Код лакокрасочного покрытия</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Comment>Тип двигателя автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКПП</Name>
					<Comment>Тип КПП автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСалона</Name>
					<Comment>Тип салона автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСалона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГаражный</Name>
					<Comment>Гаражный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Comment>Продавец автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаГарантии</Name>
					<Comment>Дата начала гарантийного срока</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестоимости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантии</Name>
					<Comment>Дата окончания гарантийного срока</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальныйVIN</Name>
					<Comment>Оригинальный VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись об автомобиле</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата создания записи об автомобиле</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Включать автомобиль в прайс-лист</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидВключенияВПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>Грузовая таможенная декларация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Comment>Марка автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Марки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДляКартинки</Name>
					<Comment>Комментарий для страницы описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтомобилиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДвигателя</Name>
					<Comment>Модель двигателя автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидВключенияВПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидВключенияВПрайсЛист</Name>
			<Comment>Вид включения в прайс-лист</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Comment>По умолчанию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсегдаВключатьВПрайсЛист</Name>
					<Comment>Всегда включать в прайс-лист</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсегдаНеВключатьВПрайсЛист</Name>
					<Comment>Всегда не включать в прайс-лист</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Автомобили/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектов.ПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжатьЗаполнение = ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	
	
	Если НЕ ПродолжатьЗаполнение Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоЗаказамНаАвтомобили(ДанныеЗаполнения);
	ЗаполнитьПоМарке(ДанныеЗаполнения);
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ВалютаУчета.Пустая() Тогда
			
			ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			
		КонецЕсли;
		
		Если ВключатьВПрайсЛист.Пустая() Тогда
			
			Если Родитель.ВключатьВПрайсЛист.Пустая() Тогда
				
				ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
				
			Иначе
				
				ВключатьВПрайсЛист = Родитель.ВключатьВПрайсЛист;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Автор = Неопределено;
	ДатаРегистрации = Неопределено;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Автор = Неопределено;
	ДатаРегистрации = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		РезультатПроверки = АвтомобилиСервер.НомераАвтомобиляКорректны(ЭтотОбъект);
		Отказ = Отказ ИЛИ РезультатПроверки.Ошибка;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		РезультатПроверки = АвтомобилиСервер.НомераАвтомобиляУникальны(ЭтотОбъект);
		Отказ = Отказ ИЛИ РезультатПроверки.Ошибка;
		
	КонецЕсли;
	
	// Проверим заполнение РНПТ у послеживаемого товара
	УчетПрослеживаемыхТоваровСервер.ПроверитьЗаполнениеРНПТПрослеживаемогоАвтомобиля(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(ВариантКомплектации) Тогда
			ТипКузова    = Справочники.ТипыКузовов.ПустаяСсылка();
			ТипКПП       = Справочники.ТипыКПП.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ МодельДвигателя.Пустая() Тогда
			ТипДвигателя = Справочники.ТипыДвигателей.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда
			НаименованиеПолное = Наименование;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Автор           = Пользователи.ТекущийПользователь();
		ДатаРегистрации = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоЗаказамНаАвтомобили(ДанныеЗаполнения)
	
	Если НЕ ЭтоЗаказСАвтомобилем(ДанныеЗаполнения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПереносимыеПоля = "Модель,
					  |ВариантКомплектации,
					  |Цвет,
					  |ЦветКод,
					  |ТипСалона";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, ПереносимыеПоля);	
		
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ВариантКомплектации) Тогда
		
		РеквизитыВариантКомплектации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеЗаполнения.ВариантКомплектации, "ТипКузова,ТипДвигателя,ТипКПП");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВариантКомплектации);
		
	КонецЕсли;
	
	Если ЭтоЗаказПоставщикуНаАвтомобиль(ДанныеЗаполнения) Тогда
		
		Поставщик = ДанныеЗаполнения.Контрагент;
		
	КонецЕсли;
			
	Наименование       = Справочники.Автомобили.СформироватьНаименованиеПоУмолчанию(ЭтотОбъект);
	НаименованиеПолное = Справочники.Автомобили.СформироватьНаименованиеПолноеПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Функция ЭтоЗаказСАвтомобилем(Документ)
	
	Возврат ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаАвтомобиль")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщикуНаАвтомобиль")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказНаАвтомобиль")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказПоставщикуНаАвтомобиль");
	
КонецФункции

Функция ЭтоЗаказПоставщикуНаАвтомобиль(Документ)
	
	Возврат ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщикуНаАвтомобиль")
		ИЛИ  ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаказПоставщикуНаАвтомобиль");
	
КонецФункции

Процедура ЗаполнитьПоМарке(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("СправочникСсылка.Марки") Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеПолное = "";
	Марка = ДанныеЗаполнения;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
